<?php

use Illuminate\Database\Schema\Blueprint;
use Illuminate\Database\Migrations\Migration;

class SeedEteIndustryTable extends Migration
{
    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up(){
        DB::select("INSERT INTO `ete_industry` (`i_name`, `i_pid`, `i_hot`) VALUES ('技术', '0', '0'),('产品', '0', '0'),('后端开发', '1', '0'),('前段开发', '1', '0'),('移动开发', '1', '0'),('测试', '1', '0'),('运维', '1', '0'),('DBA', '1', '0'),('java', '3', '0'),('C++', '3', '1'),('PHP', '3', '1'),('C', '3', '1'),('C#', '3', '1'),('.NET', '3', '1'),('Hadoop', '3', '1'),('Python', '3', '0'),('Delphi', '3', '0'),('VB', '3', '1'),('Perl', '3', '1'),('Ruby', '3', '1'),('Node.js', '3', '0'),('HTML5', '5', '0'),('Android', '5', '0'),('iOS', '5', '0'),('WP', '5', '0'),('web前端', '4', '0'),('Flash', '4', '0'),('html5', '4', '0'),('javaScript', '4', '0'),('U3D', '4', '0'),('COCOS2D-X', '4', '0'),('测试工程师', '6', '0'),('自动化测试', '6', '0'),('功能测试', '6', '0'),('性能测试', '6', '0'),('测试开发', '6', '0'),('运维工程师', '7', '0'),('运维开发工程师', '7', '0'),('网络工程师', '7', '0'),('系统工程师', '7', '0'),('IT支持', '7', '0'),('MYSQL', '8', '0'),('SQLServer', '8', '0'),('Oracle', '8', '0'),('DB2', '8', '0'),('MongoDB', '8', '0'),('产品经理', '2', '1'),('产品设计师', '2', '0'),('高端产品职位', '2', '0'),('产品部经理', '49', '0'),('产品总监', '49', '1'),('网页产品设计师', '48', '0'),('无线产品设计师', '48', '0'),('产品经理', '47', '0'),('网页产品经理', '47', '0'),('移动产品经理', '47', '1'),('产品助理', '47', '0'),('数据产品经理', '47', '0'),('电商产品经理', '47', '0'),('游戏策划', '47', '1'),('设计', '0', '0'),('视觉设计', '61', '0'),('视觉设计师', '62', '1'),('网页设计师', '62', '1'),('Flash设计师', '62', '0'),('APP设计师', '62', '0'),('UI设计师', '62', '1'),('平面设计师', '62', '1'),('美术设计师', '62', '0'),('广告设计师', '62', '0'),('多媒体设计师', '62', '0'),('原画师', '62', '0'),('游戏特效', '62', '0'),('游戏界面设计师', '62', '0'),('游戏场景', '62', '0'),('游戏角色', '62', '0'),('游戏动作', '62', '0'),('交互设计', '61', '0'),('交互设计师', '78', '0'),('无线交互设计师', '78', '0'),('网页交互设计师', '78', '0'),('硬件交互设计师', '78', '0'),('用户研究', '61', '0'),('数据分析师', '83', '0'),('用户研究员', '83', '0'),('游戏数值策划', '83', '0'),('高端职位', '61', '0'),('设计经理/主管', '87', '0'),('设计总监', '87', '0'),('视觉设计经理/主管', '87', '0'),('视觉设计总监', '87', '0'),('交互设计经理/主管', '87', '0'),('交互设计总监', '87', '0'),('用户研究经理/主管', '87', '0'),('用户研究总监', '87', '0'),('运营', '0', '0'),('运营', '96', '0'),('用户运营', '97', '1'),('产品运营', '97', '0'),( '数据运营', '97', '0'),( '内容运营', '97', '1'),( '活动运营', '97', '0'),( '商家运营', '97', '0'),( '品类运营', '97', '0'),( '游戏运营', '97', '0'),( '网络推广', '97', '1'),( '市场与销售 ', '0', '0'),( '编辑', '96', '0'),( '副主编', '108', '0'),( '内容编辑', '108', '0'),( '客服', '96', '0'),( '售前咨询', '111', '0'),( '售后客服', '111', '0'),( '高端职位', '96', '0'),( '主编', '114', '0'),( '运营总监', '87', '0'),( 'COO', '87', '0'),( '市场/营销', '107', '0'),( '市场营销', '118', '0'),( '市场策划', '118', '0'),( '市场顾问', '118', '0'),( '市场推广', '118', '0'),( 'SEO', '118', '0'),( 'SEM', '118', '0'),( '商务渠道', '118', '0'),( '商业数据分析', '118', '0'),( '活动策划', '118', '0'),( '公关', '107', '0'),( '媒介经理', '128', '0'),( '广告协调', '128', '0'),( '品牌公关', '128', '0'),( '销售', '107', '0'),( '销售专员', '132', '1'),( '销售经理', '132', '1'),( '客户代表', '132', '1'),( '大客户代表', '132', '1'),( 'BD经理', '132', '0'),( '商务渠道', '132', '0'),( '渠道销售', '132', '0'),( '代理商销售', '132', '0'),( '高端职位', '107', '0'),( '市场总监', '141', '0'),( '销售总监', '141', '0'),( '商务总监', '141', '0'),( 'CMO', '141', '0'),( '公关总监', '141', '0'),( '职能', '0', '0'),( '人力资源', '147', '0'),( '人力资源', '148', '1'),( '招聘', '148', '1'),( 'HRBP', '148', '1'),( '人事/HR', '148', '1'),( '培训经理', '148', '0'),( '薪资福利经理', '148', '0'),( '绩效考核经理', '148', '0'),( '行政', '147', '0'),( '助理', '156', '0'),( '前台', '156', '0'),( '法务', '156', '0'),( '行政', '156', '0'),( '财务', '147', '0'),( '会计', '161', '0'),( '出纳', '161', '0'),( '财务', '161', '0'),( '高端职位', '147', '0'),( '行政总监/经理', '165', '0'),( '财务总监/经理', '165', '0'),( 'HRD/HRM', '165', '0'),( 'CFO', '165', '0');");
        DB::table('company')->insert([
            'c_name' => ''
        ]);
        DB::table('admin')->insert([
            'a_name' => 'admin',
            'a_pwd' => md5('123123')
        ]);
        DB::table('education')->insert([
            'ed_name' => '不限'
        ]);
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        DB::table('industry')->delete();
        DB::table('admin')->delete();
        DB::table('company')->delete();
        DB::table('education')->delete();
    }
}
